{
    "new_york_style": "New York Style Pizza",
    "new_york_style_subtitle": "Iconic large, hand-tossed thin crust pizza sold by the slice",
    "new_york_style_family": "American Pizza",
    "new_york_style_variant": "Classic New York Slice",
    "new_york_style_origin_country": "United States",
    "new_york_style_origin_region": "New York City",
    "new_york_style_origin_period": "Early 1900s, first pizzeria 1905",
    "new_york_style_intro": "New York-style pizza is an American adaptation of Neapolitan pizza, characterized by its large, hand-tossed thin crust that's crispy on the edges yet soft and pliable enough to fold. First introduced at Lombardi's in 1905, it became the quintessential American pizza style.",
    "new_york_style_history": "The origins of New York-style pizza trace back to the late 19th and early 20th centuries with Italian immigration to New York City. Gennaro Lombardi founded the first licensed pizzeria in the U.S., Lombardi's, in 1905. His employee Antonio Totonno Pero made the pizzas, sold for five cents each. Totonno later opened his own pizzeria in Coney Island in 1924. The style evolved from Neapolitan traditions but adapted to American tastes and available ingredients, particularly using coal-fired ovens instead of wood-fired ones due to coal's economic availability in the U.S.",
    "new_york_style_sig_1": "The quintessential American pizza style, defining pizza culture in the United States",
    "new_york_style_sig_2": "Pioneered the 'slice culture' - selling pizza by the slice made it accessible to working-class Americans",
    "new_york_style_sig_3": "The 'Pizza Principle' - an economic indicator where slice cost historically correlated with subway fare",
    "new_york_style_sig_4": "Symbol of New York City's fast-paced, diverse, and democratic food culture",
    "new_york_style_sig_5": "Coal-fired ovens became a hallmark of authentic NYC pizzerias, creating distinctive flavor",
    "new_york_style_consum_1": "Traditionally sold by the slice, folded in half for eating on-the-go",
    "new_york_style_consum_2": "Quintessential quick lunch or late-night snack in New York City",
    "new_york_style_consum_3": "Often eaten standing up at the counter or while walking",
    "new_york_style_consum_4": "The 'fold test' - authentic NY pizza should be pliable enough to fold without breaking",
    "new_york_style_consum_5": "Typically served on paper plates with napkins, emphasizing casual accessibility",
    "new_york_style_evo_1": "1905: Lombardi's opens as first licensed pizzeria in the U.S., establishing NY style foundations",
    "new_york_style_evo_2": "1920s: Coal-fired ovens become standard due to economic availability, creating signature char",
    "new_york_style_evo_3": "1924: Totonno's opens in Coney Island, spreading the style beyond Manhattan",
    "new_york_style_evo_4": "Post-WWII: Gas ovens become prevalent, allowing longer bake times and easier slice reheating",
    "new_york_style_evo_5": "1950s-60s: Slice culture explodes, making pizza accessible to all economic classes",
    "new_york_style_evo_6": "2000s-present: Resurgence of coal-fired ovens as pizzerias seek authentic original flavor",
    "new_york_style_rituals_1": "The Fold: folding the slice in half lengthwise to eat, preventing toppings from sliding off",
    "new_york_style_rituals_2": "The Blot: using a napkin to dab excess oil from the cheese before eating",
    "new_york_style_rituals_3": "The Debate: endless discussions about which pizzeria makes the 'best' slice in the city",
    "new_york_style_flavor_1": "Balanced, not overpowering - simple tomato sauce with light seasoning",
    "new_york_style_flavor_2": "Dry, grated mozzarella that caramelizes and becomes stretchy when melted",
    "new_york_style_flavor_3": "Slightly sweet tomato sauce with garlic and oregano notes",
    "new_york_style_flavor_4": "Characteristic bread-like crust with subtle wheat and yeast flavors",
    "new_york_style_flavor_5": "Coal-fired versions have distinctive smoky, slightly charred notes",
    "new_york_style_aroma_1": "Fresh baked bread with yeasty, fermented notes",
    "new_york_style_aroma_2": "Sweet tomato sauce with hints of garlic and oregano",
    "new_york_style_aroma_3": "Caramelized cheese with slightly browned, toasted notes",
    "new_york_style_aroma_4": "Coal smoke and char (in traditional coal-fired ovens)",
    "new_york_style_aroma_5": "Olive oil and dried herbs from the crust",
    "new_york_style_texture_1": "Thin, crispy crust along the edges that provides structural integrity",
    "new_york_style_texture_2": "Soft, pliable center that folds without cracking - the signature 'fold'",
    "new_york_style_texture_3": "Chewy, elastic texture from high-gluten bread flour",
    "new_york_style_texture_4": "Slightly oily surface from the cheese and light oil brushing",
    "new_york_style_texture_5": "Sturdy enough to support toppings without becoming soggy",
    "new_york_style_pair_1": "Classic American lager or craft beer",
    "new_york_style_pair_2": "Italian sodas or traditional Coca-Cola",
    "new_york_style_pair_3": "Simple green salad with Italian dressing",
    "new_york_style_pair_4": "Garlic knots or garlic bread as appetizer",
    "new_york_style_pair_5": "Italian ices or cannoli for dessert",
    "new_york_style_fe_1": "Best consumed fresh and hot, within 10-15 minutes of baking",
    "new_york_style_fe_2": "Reheats well due to lower moisture content compared to Neapolitan",
    "new_york_style_fe_3": "Cold leftover slices are a NYC tradition - eaten straight from the fridge",
    "new_york_style_tech_1": "High-gluten bread flour (12.5-14% protein) for characteristic chew and foldability",
    "new_york_style_tech_2": "Coal-fired ovens reaching 900°F (482°C) for 2-5 minute bake, or gas ovens at lower temps",
    "new_york_style_tech_3": "Hand-tossing technique to stretch dough into large, thin rounds (18-24 inches)",
    "new_york_style_di_1": "High-gluten flour creates strong, elastic dough that can be stretched very thin",
    "new_york_style_di_2": "NYC tap water minerals contribute to unique dough texture and flavor (local legend)",
    "new_york_style_di_3": "Moderate hydration (58-65%) creates balance between crispy and pliable",
    "new_york_style_di_4": "Cold fermentation (24-72 hours) develops complex flavors and improves texture",
    "new_york_style_di_5": "Light oil coating prevents drying and adds subtle richness",
    "new_york_style_bi_1": "Coal-fired ovens create intense, uneven heat for characteristic charring and spotting",
    "new_york_style_bi_2": "High heat (800-900°F) cooks pizza quickly while maintaining crispy-chewy balance",
    "new_york_style_bi_3": "Gas ovens allow longer bake times (6-8 minutes) and easier temperature control",
    "new_york_style_bi_4": "Large pizza size (18-24 inches) requires even heat distribution for consistent bake",
    "new_york_style_bi_5": "Deck ovens provide bottom heat for crispy crust while top heat melts cheese",
    "new_york_style_flour_strength": "High-gluten bread flour, 12.5-14% protein for elasticity and chew",
    "new_york_style_fermentation_bulk": "24-72 hours cold fermentation for flavor development",
    "new_york_style_fermentation_proof": "2-4 hours at room temperature after shaping",
    "new_york_style_fermentation_retard": "Essential - cold fermentation is standard practice for authentic NY style",
    "new_york_style_oven_notes": "Traditional coal-fired ovens at 800-900°F for 2-5 minutes, or gas deck ovens at 550-650°F for 6-8 minutes",
    "new_york_style_use_1": "Classic cheese pizza sold by the slice",
    "new_york_style_use_2": "Pepperoni, sausage, or simple vegetable toppings",
    "new_york_style_rv_1": "Coal-fired style - original method using coal ovens for distinctive char and smoke",
    "new_york_style_rv_2": "Gas deck style - modern adaptation using gas ovens for consistency",
    "new_york_style_rv_3": "Grandma style - thicker, square pan pizza with similar flavor profile",
    "new_york_style_cs_1": "Hot, humid summers: Reduce water slightly and use cooler water for mixing",
    "new_york_style_cs_2": "Cold winters: Extend proofing time and use warmer water to maintain yeast activity",
    "new_york_style_cs_3": "High altitude: Reduce yeast slightly and adjust baking time for faster cooking",
    "new_york_style_cs_4": "Dry climates: May need slightly more water to prevent dough from drying during fermentation",
    "new_york_style_sc_1": "vs. Neapolitan: NY is crispier, foldable, and less wet; Neapolitan is softer with puffy crust",
    "new_york_style_sc_2": "vs. Chicago Deep Dish: NY is thin and foldable; Chicago is thick, pie-like, and requires utensils",
    "new_york_style_sc_3": "vs. Detroit Style: NY is round and hand-tossed; Detroit is rectangular, pan-baked with crispy edges",
    "new_york_style_ps_1": "Flour protein content critical - too low results in floppy, non-foldable crust",
    "new_york_style_ps_2": "Oven temperature crucial - too low creates tough, bread-like texture; too high burns before cooking through",
    "new_york_style_ps_3": "Sauce quantity sensitive - too much makes crust soggy; too little makes it dry",
    "new_york_style_risk_1": "Over-saucing leads to soggy center that can't be folded properly",
    "new_york_style_risk_2": "Insufficient gluten development results in crust that tears when folded",
    "new_york_style_risk_3": "Too much cheese creates greasy surface and masks other flavors",
    "new_york_style_note_1": "The 'fold test' is essential - authentic NY pizza must fold without breaking",
    "new_york_style_note_2": "NYC tap water is often credited but technique and flour quality are more important",
    "new_york_style_note_3": "Slice culture made pizza democratic - accessible to all economic classes",
    "new_york_style_tag_1": "american",
    "new_york_style_tag_2": "coal-fired",
    "new_york_style_tag_3": "slice culture",
    "new_york_style_ref_1_title": "Wikipedia - New York-style pizza",
    "new_york_style_ref_1_author": "Wikipedia contributors",
    "new_york_style_faq_1_q": "What makes New York pizza different from other styles?",
    "new_york_style_faq_1_a": "New York pizza is characterized by its large size (18-24 inches), hand-tossed thin crust that's crispy on edges but soft enough to fold, high-gluten flour for chew, and traditionally coal-fired ovens. The key is the balance between crispy and pliable - you should be able to fold a slice in half without it breaking.",
    "new_york_style_faq_2_q": "Is NYC tap water really the secret to authentic New York pizza?",
    "new_york_style_faq_2_a": "While NYC tap water is often cited, the reality is that technique, flour quality, and fermentation time are far more important. The minerals in NYC water may contribute slightly to texture, but skilled pizzaiolos can replicate NY-style pizza anywhere with proper technique and high-gluten flour.",
    "new_york_style_faq_3_q": "Why do New Yorkers fold their pizza slices?",
    "new_york_style_faq_3_a": "Folding serves multiple purposes: it creates structural integrity for the thin, large slice, prevents toppings from sliding off, makes it easier to eat on-the-go, and creates a pocket that catches any dripping oil or sauce. The ability to fold without breaking is actually a quality test for authentic NY pizza."
}