{
    "new_york_slice_v2_science_flour": "La alta proteína requiere aceite/azúcar (ablandadores) para permitir el 'pliegue' sin que la corteza se agriete como una galleta. La densidad del gluten soporta el gran diámetro de 18 pulgadas.",
    "new_york_slice_v2_dd_hydration": "62-65% es el punto ideal. Permite que la masa sea lo suficientemente extensible para estirarse a 18 pulgadas pero proporciona suficiente estructura para mantener el pliegue ('The Fold') sin caerse.",
    "detroit_style_classic_science_flour": "La estructura está soportada por las paredes del molde de acero, por lo que no necesitamos una fuerza de gluten extrema. La alta hidratación ayuda a la miga abierta tipo 'focaccia'.",
    "detroit_style_classic_dd_hydration": "70-75% es obligatorio. Esto es efectivamente una focaccia horneada con queso. La gran cantidad de agua asegura que la miga gruesa permanezca ligera y aireada como una esponja, no densa como un ladrillo.",
    "chicago_deep_dish_science_flour": "Una 'Masa Corta'. El alto contenido de grasa recubre las proteínas, impidiendo cadenas largas de gluten. Esto crea una ruptura hojaldrada, tipo galleta, en lugar de una masticable.",
    "chicago_deep_dish_dd_hydration": "50-55% más alta grasa (15%+ Aceite de Maíz/Mantequilla). Esto NO es pan. Es una corteza de pastel salado. Una hidratación alta desarrollaría gluten -> masticable -> incorrecto.",
    "sf_sourdough_science_flour": "La proteólisis (ácido degradando gluten) es el enemigo. Necesitamos harina muy fuerte para sobrevivir a la larga fermentación ácida sin colapsar.",
    "sf_sourdough_dd_hydration": "75%+ es estándar. La acidez del Levain tensa la estructura del gluten, permitiéndole retener mucha agua sin convertirse en sopa. El agua es necesaria para la miga abierta.",
    "new_haven_apizza_science_flour": "Se requiere alta fuerza para estirar muy fino sin rasgarse, pero una fermentación fría prolongada relaja el gluten (extensibilidad).",
    "new_haven_apizza_dd_hydration": "60-65% impulsa el carbonizado. Necesita estar lo suficientemente seca para crujir rápidamente, pero lo suficientemente húmeda para soportar la fermentación de 48h sin secarse en la nevera.",
    "nyc_bagel_science_flour": "Se usa la harina con mayor proteína posible. Como la hidratación es baja (50%), el gluten es increíblemente tenso, creando la textura masticable 'ejercicio de mandíbula'.",
    "nyc_bagel_dd_hydration": "50-55% es rígida. Extremadamente rígida. Esta tensión + hervido es lo que restringe la expansión, creando la textura densa y masticable. Si hidratas al 65%, acabas de hacer un panecillo redondo.",
    "grandma_style_v2_science_flour": "No requiere alta proteína. Una harina más suave ayuda a que se estire en las esquinas del molde sin encogerse.",
    "grandma_style_v2_dd_hydration": "60-65% asegura un fondo crujiente (frito en el aceite del molde) pero una miga lo suficientemente densa para soportar los ingredientes. Demasiado aireada y pierde la rusticidad 'casera'.",
    "chicago_tavern_v2_science_flour": "El objetivo es 'Masa Muerta'. Queremos cero elasticidad para que se estire fina como papel, y cero salto de horno (hinchazón). Baja hidratación + rodillo logra esto.",
    "chicago_tavern_v2_dd_hydration": "45-50%. Extremadamente seca. Necesitamos prevenir el vapor. El vapor crea hinchazón. La hinchazón crea suavidad. Queremos una galleta muerta y plana.",
    "montreal_bagel_science_flour": "Se necesita alto gluten para retener la forma durante el hervido. La falta de sal debilita la red, así que una masa rígida compensa.",
    "montreal_bagel_dd_hydration": "50-55%. Muy rígida.",
    "flour_tortilla_sonora_science_flour": "Alta grasa  agua caliente  ternura y extensibilidad",
    "flour_tortilla_sonora_dd_hydration": "Poca agua mucha grasa",
    "baguette_tradition_science_flour": "Requiere harina T65 con proteína respetable (11-12%) pero alta extensibilidad. A diferencia de las harinas americanas de alta proteína, la harina francesa permite la masa extensible característica que no se encoge al rodar.",
    "baguette_tradition_science_process": "El \"Décret Pain\" de 1993 prohíbe aditivos. El crujido y color (Maillard) dependen exclusivamente de la caramelización natural de la harina y la inyección de vapor que gelatiniza el almidón superficial, creando una corteza brillante, fina y crujiente.",
    "brioche_tete_science_flour": "Requiere fuerte producción de gluten para cargar con la gran cantidad de grasa. Sin embargo, se prefiere T45 por su finura.",
    "brioche_tete_science_process": "Una emulsión estable de grasa y agua. La mantequilla debe añadirse plástica (fría/maleable) solo DESPUÉS del desarrollo del gluten. Si se añade demasiado pronto, recubre las proteínas e impide la reticulación (efecto manteca).",
    "laugenbrezel_science_flour": "Masa rígida (aprox 50% hidratación) requerida para mantener la forma intrincada durante el baño y horneado.",
    "laugenbrezel_science_process": "El baño en solución de Hidróxido de Sodio (Sosa) (pH 13-14) descompone las proteínas en la superficie y promueve una reacción de Maillard extrema y acelerada, resultando en el color marrón profundo y sabor específico a \"pretzel\".",
    "english_muffin_science_flour": "Se necesita alta proteína para soportar la alta hidratación (aprox 80%) que crea las grandes burbujas (rincones) durante la cocción en plancha.",
    "english_muffin_science_process": "El corte con tenedor: Cortar con cuchillo corta las hebras de gluten y arruina la textura. Separar con la mano (o usar un tenedor) preserva los picos y valles (rincones) que retienen la mantequilla.",
    "khachapuri_adjaruli_science_flour": "Se necesita extensibilidad para plegar los lados del \"barco\" sin que se abran de nuevo durante el horneado.",
    "khachapuri_adjaruli_science_process": "La forma de barco (Nave) actúa como contenedor. La mezcla de queso se funde y emulsiona con la mantequilla. La adición final de la yema de huevo confía en el calor residual del queso para cocinarse parcialmente (pasteurizarse) mientras se remueve.",
    "danish_rugbrod_science_flour": "El centeno contiene glutenina/gliadina pero no forman una red como el trigo. La estructura viene de los pentosanos (gomas) y gelatinización del almidón. El ácido (Masa Madre) es OBLIGATORIO para prevenir el \"ataque de almidón\" (amilasa destruyendo estructura).",
    "danish_rugbrod_science_process": "El ataque de Almidón: El centeno es alto en enzimas amilasas. Si el pH no se baja (<4.5), estas enzimas digerirán el almidón durante el horneado, resultando en una aza gormosa y colapsada. La masa madre no es solo por sabor; es una necesidad estructural.",
    "tiger_bread_science_flour": "La masa en sí es un pan blanco vibrante estándar. La ciencia está en la cobertura.",
    "tiger_bread_science_process": "La pasta Tigre está hecha de Harina de Arroz, Levadura, Azúcar, Aceite y Agua. Dado que la harina de arroz carece de gluten, no se expande. A medida que la hogaza se expande debajo (Salto de Horno), la pasta de arroz rígida se agrieta, creando el patrón y el crujido intenso.",
    "irish_soda_bread_science_flour": "Se prefiere harina de baja proteína. La alta proteína lo haría duro/gomoso porque no hay fermentación para relajar el gluten.",
    "irish_soda_bread_science_process": "Reacción Ácido-Base: Ácido Láctico (Suero de leche) + Bicarbonato de Sodio = CO2 + Agua + Sal. Esta reacción es instantánea. La masa debe hornearse inmediatamente o el gas se pierde.",
    "pizza_napoletana_science_flour": "Requiere harina '00' con W280-320. La clave es el control estricto de P/L (0.50-0.60): necesitamos extensibilidad para un estirado fácil sin encogimiento, pero suficiente fuerza para retener gas durante una larga fermentación de 24h a temperatura ambiente.",
    "pizza_napoletana_science_process": "El evento físico definitorio es la 'Evaporación Súbita'. A >430°C, la humedad en la masa se convierte en vapor casi instantáneamente. Debido a que el gluten está relajado (extensible), el cornicione se infla rápidamente antes de que la corteza se asiente, creando los 'vacíos' característicos dentro del borde.",
    "pizza_napoletana_dd_hydration": "58-62% es el estándar STG porque el horno de leña a 485°C requiere evaporación rápida sin quemar la corteza. El estilo moderno 'Canotto' usa 70%+, pero exige harina mucho más fuerte y habilidades de manejo avanzadas.",
    "pizza_teglia_romana_science_flour": "Requiere harina extremadamente fuerte (W350+, P/L 0.55). La red de gluten debe ser lo suficientemente poderosa para retener 80%+ de agua y atrapar las enormes burbujas de CO2 durante la fermentación en frío.",
    "pizza_teglia_romana_science_process": "La ciencia definitoria es 'Gelatinización de Almidón vs Estructura de Gluten'. El agua alta permite actividad enzimática completa (proteasa), creando una textura que se derrite en la boca. La fermentación en frío (4°C) ralentiza la levadura pero deja que las bacterias produzcan ácidos que fortalecen el gluten, haciendo manejable la hidratación imposible.",
    "pizza_teglia_romana_dd_hydration": "80% es el número mágico para la textura de 'nube'. El agua alta crea bolsas de vapor (alvéolos) y mantiene la miga húmeda a pesar del horneado largo. Por debajo del 75%, es solo focaccia pesada.",
    "pizza_tonda_romana_science_flour": "Fuerza media (W240). No queremos elasticidad extrema porque la aplanamos manualmente. Demasiado nervio (elasticidad) hace que se encoja.",
    "pizza_tonda_romana_science_process": "La evaporación es el objetivo. Baja hidratación + Aceite + Rodillo = Deshidratación. Efectivamente estamos friendo la masa en su propio aceite y secándola para crear una estructura de galleta.",
    "pizza_tonda_romana_dd_hydration": "Baja hidratación (~56%) es crítica. Queremos restringir la generación de vapor para que la corteza se seque y se convierta en una galleta. La alta hidratación la haría masticable.",
    "focaccia_genovese_science_flour": "Usa una harina de fuerza Media (W260-280). No queremos elasticidad extrema; la masa debe ser lo suficientemente extensible para llenar las esquinas del molde sin pelear.",
    "focaccia_genovese_science_process": "La Ciencia Central es la 'Salamoia' (Emulsión de Salmuera). Verter una mezcla de agua y aceite sobre la masa antes de hornear crea una barrera térmica. El líquido se acumula en los hoyuelos, impidiendo que la masa allí supere los 100°C. Esto esencialmente hierve la masa en los agujeros (manteniéndolos blancos/suaves) mientras las crestas se fríen en aceite (volviéndose doradas/crujientes).",
    "focaccia_genovese_dd_hydration": "65% es equilibrado para una masa de molde. La clave no es el agua dentro, sino el aceite/salmuera fuera. La masa hierve en los bolsillos de salmuera.",
    "sfincione_palermitano_science_flour": "Semolina Remilled (Rimacinata) mezclada con trigo blando. El grano duro proporciona un 'mordisco' específico y color dorado.",
    "sfincione_palermitano_science_process": "Recubrimiento de grasa. El uso de Manteca (Strutto) acorta las hebras de gluten, creando una miga suave, tipo pastel ('Esponja') en lugar de un pan masticable.",
    "sfincione_palermitano_dd_hydration": "70% hidratación más 5% Manteca crea una masa 'corta'. La grasa recubre el gluten, previniendo que se vuelva duro, resultando en una textura de pastel esponjoso.",
    "pane_toscano_science_flour": "Usa harina débil-media. Sin sal para tensar la red de gluten, la masa es químicamente floja y fermenta mucho más rápido.",
    "pane_toscano_science_process": "Cinética de Levadura: La sal es un inhibidor de levadura. Eliminarla crea 'Levadura Corriendo', significando que la fermentación explota rápidamente. Debemos usar una Biga o Levain ácido para controlar esta velocidad y fortalecer el gluten.",
    "pane_toscano_dd_hydration": "60% es estándar. La falta de sal cambia la reología - la sal tensa el gluten. Sin ella, la masa es naturalmente floja, así que no necesitamos mucha agua para la extensibilidad.",
    "ciabatta_classic_science_flour": "Requiere Alta Proteína/Alta W (W320+). Con hidratación empujando 80%, la harina débil se degradaría en una sopa debido a la actividad de proteasa. Se necesita gluten fuerte para atrapar la generación masiva de vapor.",
    "ciabatta_classic_science_process": "La estructura es impulsada por 'Bassinage' y 'Expansión de Vapor'. Añadir agua en etapas construye la red de gluten primero. En el horno, el alto contenido de agua se convierte en vapor rápidamente. El gluten fuerte atrapa estas bolsas de gas en expansión, creando la 'Miga Abierta' característica.",
    "ciabatta_classic_dd_hydration": "78-85% es la definición de Ciabatta. Debe ser lo suficientemente húmeda para nivelarse sola. La expansión de vapor de esta agua crea los agujeros masivos."
}