{
    "steps": {
        "prep": {
            "title": "Mise en Place y Pesaje",
            "desc": "Pese todos los ingredientes con una balanza digital para precisión de 0.1g. {{waterAdvice}}",
            "grandma": "Tenga todos los ingredientes listos en el mostrador. ¡Use una balanza! Las tazas son para café, no para harina.",
            "science": "La precisión es clave. Una variación del 5% en el agua puede cambiar drásticamente la reología de la masa.",
            "critical": "No deje que la levadura entre en contacto directo con la sal por periodos prolongados antes de mezclar."
        },
        "brownie_melt": {
            "title": "Derretir Grasa y Chocolate",
            "desc": "Derrita la mantequilla (y el chocolate) suavemente al baño maría o microondas. Deje enfriar un poco (<45°C).",
            "grandma": "Derrita la mantequilla y el chocolate juntos. ¡No lo queme! Deje enfriar para no cocinar los huevos.",
            "science": "Derretir la grasa en lugar de cremarla produce una textura más densa y fudgy al reducir la incorporación de aire."
        },
        "brownie_ribbon": {
            "title": "Punto de Cinta (Huevos y Azúcar)",
            "desc": "Bata huevos y azúcar vigorosamente hasta que estén pálidos, espesos y caigan en \"cintas\" (aprox 3-5 min).",
            "grandma": "Bata los huevos y el azúcar hasta que se vean blancos y esponjosos, como un batido.",
            "science": "Disolver el azúcar en los huevos crea una costra brillante y \"papelosa\". Evaluar el punto de cinta asegura suficiente aireación."
        },
        "brownie_fold": {
            "title": "Emulsificación y Plegado",
            "desc": "Vierta la mezcla de chocolate/mantequilla en los huevos batiendo suavemente. Luego, INVOLUCRE los secos tamizados apenas hasta combinar.",
            "grandma": "Vierta el chocolate en los huevos y mezcle. Luego agregue la harina y mezcle suavemente con espátula. ¡No mezcle de más!",
            "critical": "¡No bata de más tras agregar la harina! Desarrollar gluten crea un brownie duro y gomoso en lugar de tierno."
        },
        "brownie_bake": {
            "title": "Hornear",
            "desc": "Hornee a {{temp}}°C. Pruebe con un palillo: debe salir con migas húmedas, no masa líquida.",
            "grandma": "Hornee hasta que el palillo salga con algunas migas pegadas. Si sale limpio, ¡se pasó!",
            "science": "Los brownies dependen de la coagulación de la proteína del huevo y la cristalización del azúcar para su estructura."
        },
        "cookie_cream": {
            "title": "Cremado (Mantequilla y Azúcar)",
            "desc": "Bata mantequilla ablandada y azúcar(es) juntos hasta que esté ligero, esponjoso y pálido (3-5 min).",
            "grandma": "Mezcle la mantequilla y el azúcar hasta que parezca glaseado esponjoso.",
            "science": "El método de cremado incorpora millones de microburbujas de aire en la grasa. Estas burbujas se expanden al hornear, creando ligereza.",
            "critical": "La mantequilla debe estar maleable (18-20°C) pero no derretida. La mantequilla derretida no retiene burbujas de aire."
        },
        "cookie_emulsify": {
            "title": "Emulsificación (Líquidos)",
            "desc": "Agregue huevos uno a uno, batiendo bien tras cada adición. Raspe el tazón.",
            "grandma": "Agregue huevos uno por uno. Mezcle bien para que no parezca cortado.",
            "science": "Los huevos son agua; la mantequilla es grasa. La adición incremental permite que la lecitina emulsione el agua en la grasa."
        },
        "cookie_dry": {
            "title": "Incorporación (Secos)",
            "desc": "Agregue secos de una vez. Mezcle en velocidad BAJA apenas hasta que la harina desaparezca.",
            "grandma": "Agregue la harina y mezcle despacio. Pare en cuanto el polvo blanco desaparezca.",
            "science": "Minimice el tiempo de mezcla para limitar el gluten. Hilos cortos de gluten = galletas tiernas.",
            "tip": "Agregue rellenos (chispas, nueces) ahora."
        },
        "cookie_chill": {
            "title": "Maduración en Frío",
            "desc": "Refrigere la masa por al menos 2-24 horas antes de hornear.",
            "grandma": "Ponga la masa en el refri unas horas (o toda la noche). ¡Hace mejores galletas!",
            "science": "Enfriar hidrata la harina (menos expansión), solidifica la grasa y permite que las enzimas descompongan carbohidratos (sabor)."
        },
        "cookie_bake": {
            "title": "Hornear",
            "desc": "Hornee a {{temp}}°C hasta que los bordes estén firmes pero el centro suave.",
            "grandma": "Hornee hasta que los bordes estén dorados. El centro debe verse un poco blando aún.",
            "science": "La caramelización y Maillard ocurren rápido. El centro terminará de cocinarse en la bandeja caliente fuera del horno."
        },
        "laminated_detrempe": {
            "title": "Detrempe (Masa Base)",
            "desc": "Mezcle harina, agua, levadura, sal, azúcar y la mantequilla de la masa hasta combinar. No desarrolle mucho gluten.",
            "grandma": "Mezcle los ingredientes de la masa hasta unir. ¡No amase muy fuerte!",
            "science": "Mantener la estructura de gluten subdesarrollada asegura extensibilidad para la laminación."
        },
        "laminated_block": {
            "title": "Formación del Bloque",
            "desc": "Aplaste la masa en un rectángulo, envuelva bien y refrigere 12-24h.",
            "grandma": "Aplaste la masa, envuelva y ponga en el refri hasta mañana.",
            "science": "Enfriar relaja el gluten y asegura que la masa tenga la misma consistencia que la mantequilla."
        },
        "laminated_lockin": {
            "title": "Encapsulado (Beurrage)",
            "desc": "Golpee la mantequilla hasta que esté maleable pero fría (10-12°C). Encapsule en la masa.",
            "grandma": "Aplaste la mantequilla hasta que se doble pero no se rompa. Envuelva la masa alrededor.",
            "critical": "Mantequilla y masa deben tener la misma consistencia para prevenir roturas (muy fría) o absorción (muy caliente)."
        },
        "laminated_tourage": {
            "title": "Laminación (Tourage)",
            "desc": "Haga 1 Pliegue Doble (Libro) y 1 Pliegue Simple (Carta), descansando 30m en frío entre pliegues.",
            "grandma": "Doble como libro, descanse. Doble como carta. ¡Mantenga frío!",
            "science": "Este proceso crea capas alternas de grasa y masa que se inflan al hornear."
        },
        "laminated_shape": {
            "title": "Formado",
            "desc": "Estire a 4mm. Corte triángulos (10x25cm). Alargue suavemente y enrolle firme. Barnice con huevo.",
            "grandma": "Estire fino, corte triángulos largos y enrolle apretado. Pincele huevo.",
            "tip": "Corte con movimiento decisivo hacia abajo para no sellar las capas en los bordes."
        },
        "laminated_proof": {
            "title": "Fermentación Final",
            "desc": "Fermente a 26-28°C hasta doblar y temblar (2-3h).",
            "grandma": "Deje crecer hasta que tiemble como gelatina. ¡No deje calentar mucho!",
            "critical": "Evite temperaturas sobre 29°C o la mantequilla se derretirá, arruinando el hojaldrado."
        },
        "laminated_bake": {
            "title": "Hornear",
            "desc": "Hornee a 200°C por 5-7m, luego baje a 190°C por 12-15m hasta dorar bien.",
            "grandma": "Horno caliente al inicio para subir, luego baje para terminar.",
            "science": "Calor inicial alto crea vapor para \"salto de horno\" y separa capas antes de que la corteza se fije."
        },
        "poolish_prep": {
            "title": "Preparar Poolish (Día -1)",
            "desc": "Mezcle harina y agua del Poolish (1:1) con la pizca de levadura. Cubra y fermente 12-16h a temp. ambiente.",
            "grandma": "Mezcle ingredientes del poolish en el frasco hasta parecer masa de hotcakes. Cubra y deje en el mostrador hasta mañana.",
            "science": "Poolish es un pre-fermento 100% hidratación. Aumenta actividad de proteasa (extensibilidad) y sabor.",
            "tip": "El poolish está listo cuando burbujea, dobla su tamaño y el centro empieza a colapsar."
        },
        "biga_prep": {
            "title": "Preparar Biga (Día -1)",
            "desc": "Mezcle ingredientes de la Biga suavemente. ¡No amase! Debe quedar una masa grumosa. Fermente 16-24h a 16-18°C.",
            "grandma": "Mezcle harina, agua y levadura de la biga solo para desaparecer el polvo. Debe verse seca y grumosa. Deje en lugar fresco hasta mañana.",
            "science": "Biga es un pre-fermento rígido (45-50%). Favorece ácido acético, dando fuerza y sabor complejo.",
            "critical": "Mezclar de más la Biga desarrollará mucho gluten muy pronto, haciendo imposible incorporar en la masa final."
        },
        "levain_feed": {
            "title": "Alimentar Levain",
            "desc": "Asegure que su levain esté activo y alimentado 4-6 horas antes. Debe estar en su pico.",
            "grandma": "Alimente su masa madre para que esté burbujeante y feliz antes de empezar.",
            "science": "Usar levain en su pico asegura población máxima de levaduras y pH ideal."
        },
        "autolyse": {
            "title": "Autólisis",
            "desc": "Mezcle solo Harina y Agua hasta no quedar harina seca. Cubra y descanse 30-60 min. No agregue sal/levadura aún.",
            "grandma": "Mezcle solo harina y agua. Deje descansar 30 min. La harina bebe el agua.",
            "science": "Autólisis permite que enzimas proteasa degraden algunos enlaces de gluten, aumentando extensibilidad."
        },
        "mix_final": {
            "title": "Mezcla Final ({{method}})",
            "desc": "{{mixAction}}",
            "grandma": "{{mixGrandma}}",
            "science": "La sal es higroscópica y fortalece el gluten. El aceite inhibe la formación de enlaces, debe añadirse al final.",
            "critical": "Pare de mezclar si la masa pasa de 26°C para prevenir degradación del gluten."
        },
        "fold_coil": {
            "title": "Pliegues en Bobina (Coil Folds)",
            "desc": "Haga pliegues Coil cada 30 min las primeras 2h. Mójese las manos.",
            "grandma": "Cada 30 min, levante la masa y deje doblar bajo sí misma. Hace la masa fuerte.",
            "science": "Masas de alta hidratación no pueden amasarse tradicionalmente. Doblar alinea el gluten pasivamente.",
            "tip": "Si la masa se rasga, descanse 10 min más. Extensibilidad viene del descanso; elasticidad del pliegue."
        },
        "knead_windowpane": {
            "title": "Amasado y Punto de Ventana",
            "desc": "Amase hasta que la masa pase la Prueba de Ventana: estirar fino sin rasgar.",
            "grandma": "Amase en la mesa hasta que esté lisa como pompis de bebé. Debe rebotar al picar.",
            "science": "La acción mecánica desenrolla bobinas de proteína y fomenta enlaces cruzados, creando red viscoelástica."
        },
        "bulk": {
            "title": "Fermentación en Bloque",
            "desc": "Deje fermentar la masa en recipiente cubierto hasta {{volume}}.",
            "grandma": "Deje la masa en el tazón cubierto hasta que se vea esponjosa y crezca cerca de la mitad.",
            "science": "La levadura convierte azúcares en CO2 (crecimiento) y etanol (sabor). La red de gluten se relaja.",
            "tip": "Use recipiente con lados rectos para juzgar el volumen con precisión."
        },
        "cold_maturation": {
            "title": "Maduración en Frío",
            "desc": "Coloque en el refri (4°C) por 24-72 horas.",
            "grandma": "Ponga en el refri. Puede dejar hasta 3 días. Más tiempo, más sabroso.",
            "science": "Temperaturas frías retardan la levadura pero permiten actividad enzimática y bacteriana (sabor y digestibilidad)."
        },
        "staglio": {
            "title": "Staglio (División y Boleado)",
            "desc": "Divida en {{count}} porciones. Bolee firme usando tensión superficial.",
            "grandma": "Corte en pedazos iguales. Enrolle en bolas firmes y lisas.",
            "science": "Crear una \"piel\" de tensión en la bola fuerza gases a expandir hacia arriba en vez de a los lados.",
            "critical": "Cierre bien la costura de abajo para evitar fuga de gas."
        },
        "proof": {
            "title": "Fermentación Final (Apprêt)",
            "desc": "Cubra y fermente a temp. ambiente hasta relajar (Prueba del Dedo).",
            "grandma": "Cubra y deje descansar hasta que estén suaves. Si pica, la marca debe volver despacio.",
            "science": "El gluten se relaja (aumenta extensibilidad). La levadura reinfla la estructura.",
            "tip": "Si la masa vuelve de inmediato, necesita más tiempo. Si el dedo se queda para siempre, se pasó."
        },
        "bake": {
            "title": "Hornear y Salto de Horno",
            "desc": "{{action}}",
            "grandma": "{{grandmaAction}}",
            "science": "Transferencia rápida de calor causa salto de horno. Reacción de Maillard sobre 140°C crea color y sabor.",
            "critical": "No sobrecargue con ingredientes húmedos, o bloqueará el calor resultando en masa cruda."
        }
    },
    "vars": {
        "water": {
            "room": "Use agua a temperatura ambiente (20-22°C).",
            "hot": "Use agua fría (4-10°C) para compensar el ambiente caliente.",
            "cold": "Use agua tibia (25-28°C) para despertar la levadura."
        },
        "water_tip": {
            "ideal": "La Temperatura Deseada de la Masa (DDT) ideal es 24°C.",
            "hot": "En ambientes calientes, la fricción puede sobrecalentar la masa. Agua fría ayuda a regular esto.",
            "cold": "La levadura es lenta en el frío. Un inicio más tibio ayuda a impulsar la fermentación."
        },
        "mix": {
            "double_hydration": "Doble Hidratación (Bassinage)",
            "direct": "Mezcla Directa",
            "action": {
                "default": "Agregue levadura y mezcle. Luego sal. Al final, aceite (si usa) cuando la masa forme.",
                "biga": "Corte la Biga en pedazos en el agua. Apriete para romper. Agregue harina gradualmente. Sal al final.",
                "high_hydration": "Agregue levadura y sal. Mezcle para estructura. Luego, agregue el resto del agua en hilo (Bassinage)."
            },
            "grandma": {
                "default": "Mezcle levadura. Luego sal. Si lleva aceite, al final.",
                "biga": "Rompa la Biga en el agua con las manos hasta que esté lechoso. Agregue el resto de harina y sal.",
                "high_hydration": "Mezcle levadura y sal. Cuando parezca masa, agregue agua poco a poco."
            }
        },
        "bake": {
            "action": {
                "default": "Estire suavemente. Cubra poco. Hornee en piedra/acero precalentado.",
                "pan": "Presione en molde aceitado. Deje crecer en molde 30m. Cubra y hornee."
            },
            "grandma": {
                "default": "¡Estire, ponga ingredientes y hornee bien caliente!",
                "pan": "Empuje en el molde. Descanse un poco. Ingredientes y horno."
            }
        }
    }
}