{
    "sicilian_grandma_pan": "Sicilian/Grandma Pan Pizza",
    "sicilian_grandma_pan_subtitle": "Thick, square pan pizza with Sicilian roots",
    "sicilian_grandma_pan_family": "Italian-American Pan Pizza",
    "sicilian_grandma_pan_variant": "Grandma Style",
    "sicilian_grandma_pan_origin_country": "Italy/United States",
    "sicilian_grandma_pan_origin_region": "Sicily, Italy / Long Island, New York",
    "sicilian_grandma_pan_origin_period": "17th century Sicily (sfincione) / Early 20th century NY (grandma)",
    "sicilian_grandma_pan_intro": "Sicilian pizza originated as 'sfincione' in 17th century Palermo, meaning 'thick sponge.' Grandma pizza is its Italian-American descendant, created by Long Island grandmothers in the early 20th century using home ovens and sheet pans to recreate their homeland's flavors.",
    "sicilian_grandma_pan_history": "Sicilian pizza traces back to 17th century Palermo as 'sfincione,' becoming popular in western Sicily by the mid-19th century. Traditional sfincione featured thick, spongy, focaccia-like crust topped with onions sautéed in olive oil, anchovies, tomatoes, herbs, and hard sheep's milk cheese like caciocavallo. When Italian immigrants brought sfincione to America, particularly New York, it evolved into American Sicilian pizza with mozzarella replacing traditional cheeses. Grandma pizza emerged in early 20th century Long Island as first-generation Italian-American grandmothers adapted sfincione to home kitchens, using standard sheet pans and home ovens. The term 'Grandma pizza' gained wider recognition in the mid-1990s. Unlike thick Sicilian, Grandma pizza is thinner with a crispier bottom from olive oil-coated pans, and often features cheese placed directly on dough before sauce.",
    "sicilian_grandma_pan_sig_1": "Sfincione is a cornerstone of Sicilian culinary heritage dating to 17th century",
    "sicilian_grandma_pan_sig_2": "Represents Italian immigrant adaptation to American ingredients and equipment",
    "sicilian_grandma_pan_sig_3": "Grandma pizza embodies home cooking traditions passed through generations",
    "sicilian_grandma_pan_sig_4": "Symbol of Italian-American family gatherings and Sunday dinners",
    "sicilian_grandma_pan_sig_5": "Gained recognition in 1990s as distinct style worthy of pizzeria menus",
    "sicilian_grandma_pan_sig_1": "Traditional sfincione sold as street food in Palermo markets and bakeries",
    "sicilian_grandma_pan_consum_2": "Grandma pizza created for family meals in home kitchens",
    "sicilian_grandma_pan_consum_3": "Often served at Italian-American family gatherings and celebrations",
    "sicilian_grandma_pan_consum_4": "Eaten with hands or fork, cut into squares for sharing",
    "sicilian_grandma_pan_consum_5": "Popular as hearty, filling meal rather than quick snack",
    "sicilian_grandma_pan_evo_1": "17th century: Sfincione emerges in Palermo, Sicily",
    "sicilian_grandma_pan_evo_2": "Mid-19th century: Sfincione becomes popular throughout western Sicily",
    "sicilian_grandma_pan_evo_3": "Late 19th/early 20th century: Italian immigrants bring sfincione to America",
    "sicilian_grandma_pan_evo_4": "Early 20th century: Grandma pizza develops in Long Island home kitchens",
    "sicilian_grandma_pan_evo_5": "Mid-1990s: 'Grandma pizza' term gains recognition in pizzerias",
    "sicilian_grandma_pan_evo_6": "Present: Both styles celebrated as distinct Italian and Italian-American traditions",
    "sicilian_grandma_pan_rituals_1": "Grandmothers teaching granddaughters the family recipe and technique",
    "sicilian_grandma_pan_rituals_2": "Using well-seasoned family sheet pans passed down generations",
    "sicilian_grandma_pan_rituals_3": "Placing cheese before sauce - a signature Grandma pizza technique",
    "sicilian_grandma_pan_flavor_1": "Thick, bread-like crust with focaccia characteristics",
    "sicilian_grandma_pan_flavor_2": "Traditional sfincione: onions, anchovies, hard sheep's milk cheese",
    "sicilian_grandma_pan_flavor_3": "Grandma style: fresh mozzarella, garlic, basil, simple tomato sauce",
    "sicilian_grandma_pan_flavor_4": "Olive oil-rich, creating savory depth throughout",
    "sicilian_grandma_pan_flavor_5": "Hearty, satisfying - more meal than snack",
    "sicilian_grandma_pan_aroma_1": "Fresh baked bread with yeasty, fermented notes",
    "sicilian_grandma_pan_aroma_2": "Garlic and herbs (basil, oregano) prominent",
    "sicilian_grandma_pan_aroma_3": "Olive oil creating rich, savory aromatics",
    "sicilian_grandma_pan_aroma_4": "Caramelized onions in traditional sfincione",
    "sicilian_grandma_pan_aroma_5": "Tomato sauce with sweet, acidic notes",
    "sicilian_grandma_pan_texture_1": "Thick, spongy, focaccia-like interior crumb",
    "sicilian_grandma_pan_texture_2": "Crispy, olive oil-fried bottom crust (especially Grandma style)",
    "sicilian_grandma_pan_texture_3": "Tender, airy interior from proper proofing",
    "sicilian_grandma_pan_texture_4": "Slightly chewy from bread-like dough structure",
    "sicilian_grandma_pan_texture_5": "Substantial, filling texture - knife-and-fork pizza",
    "sicilian_grandma_pan_pair_1": "Sicilian red wines like Nero d'Avola or Frappato",
    "sicilian_grandma_pan_pair_2": "Italian-American red wines or Chianti",
    "sicilian_grandma_pan_pair_3": "Simple Italian salad with vinaigrette",
    "sicilian_grandma_pan_pair_4": "Antipasti platter with olives, peppers, cheeses",
    "sicilian_grandma_pan_pair_5": "Italian ices or cannoli for dessert",
    "sicilian_grandma_pan_fe_1": "Best consumed within 30 minutes of baking while crust is optimal",
    "sicilian_grandma_pan_fe_2": "Reheats reasonably well in oven, better than thin-crust styles",
    "sicilian_grandma_pan_fe_3": "Flavors meld and develop as pizza cools slightly",
    "sicilian_grandma_pan_tech_1": "Thick dough proofed in oiled sheet pans or rectangular pans",
    "sicilian_grandma_pan_tech_2": "Grandma style: cheese before sauce to prevent soggy bottom",
    "sicilian_grandma_pan_tech_3": "Moderate oven temperature (425-475°F) for longer bake to cook through thick dough",
    "sicilian_grandma_pan_di_1": "Moderate to high hydration (65-75%) creates spongy, airy texture",
    "sicilian_grandma_pan_di_2": "Bread flour provides structure to support thick, heavy toppings",
    "sicilian_grandma_pan_di_3": "Longer proofing time (2-4 hours) in pan creates characteristic thickness",
    "sicilian_grandma_pan_di_4": "Olive oil in dough and pan creates rich flavor and crispy bottom",
    "sicilian_grandma_pan_di_5": "Dough pressed into pan rather than stretched, creating even thickness",
    "sicilian_grandma_pan_bi_1": "Sheet pan or rectangular pan essential for authentic square shape",
    "sicilian_grandma_pan_bi_2": "Heavy olive oil coating creates fried, crispy bottom",
    "sicilian_grandma_pan_bi_3": "Moderate temperature (425-475°F) prevents burning while cooking through",
    "sicilian_grandma_pan_bi_4": "Longer bake time (15-25 minutes) needed for thick dough",
    "sicilian_grandma_pan_bi_5": "Cheese-before-sauce technique prevents moisture from making crust soggy",
    "sicilian_grandma_pan_flour_strength": "Bread flour, 12-13% protein for structure",
    "sicilian_grandma_pan_fermentation_bulk": "1-2 hours bulk fermentation",
    "sicilian_grandma_pan_fermentation_proof": "2-4 hours in oiled pan until doubled",
    "sicilian_grandma_pan_fermentation_retard": "Optional overnight cold retard for flavor development",
    "sicilian_grandma_pan_oven_notes": "Home or deck oven at 425-475°F for 15-25 minutes until golden and crispy on bottom",
    "sicilian_grandma_pan_use_1": "Family-style square pizza for gatherings",
    "sicilian_grandma_pan_use_2": "Hearty meal pizza with substantial toppings",
    "sicilian_grandma_pan_rv_1": "Traditional Sicilian Sfincione - onions, anchovies, caciocavallo cheese",
    "sicilian_grandma_pan_rv_2": "Long Island Grandma - thin crust, cheese before sauce, fresh mozzarella",
    "sicilian_grandma_pan_rv_3": "American Sicilian - thick crust, mozzarella, standard pizza toppings",
    "sicilian_grandma_pan_cs_1": "Hot, humid climates: Reduce proofing time to prevent over-fermentation",
    "sicilian_grandma_pan_cs_2": "Cold climates: Extend proofing time and use warmer water",
    "sicilian_grandma_pan_cs_3": "High altitude: Reduce yeast slightly and adjust baking time",
    "sicilian_grandma_pan_cs_4": "Dry climates: May need slightly more water in dough",
    "sicilian_grandma_pan_sc_1": "vs. Neapolitan: Sicilian is thick and spongy; Neapolitan is thin with puffy edges",
    "sicilian_grandma_pan_sc_2": "vs. Detroit Style: Sicilian is softer; Detroit has crispy cheese edges (frico)",
    "sicilian_grandma_pan_sc_3": "vs. Focaccia: Sicilian pizza has more toppings; focaccia is simpler flatbread",
    "sicilian_grandma_pan_ps_1": "Proofing time critical - under-proofed is dense; over-proofed collapses",
    "sicilian_grandma_pan_ps_2": "Pan oiling essential - insufficient oil creates stuck, pale bottom",
    "sicilian_grandma_pan_ps_3": "Topping weight sensitive - too heavy compresses spongy texture",
    "sicilian_grandma_pan_risk_1": "Over-proofing causes dough to collapse, losing airy texture",
    "sicilian_grandma_pan_risk_2": "Insufficient olive oil results in stuck dough and pale bottom",
    "sicilian_grandma_pan_risk_3": "Too much sauce makes thick crust soggy in center",
    "sicilian_grandma_pan_note_1": "Sfincione means 'thick sponge' in Sicilian dialect",
    "sicilian_grandma_pan_note_2": "Grandma pizza named after Italian-American grandmothers who created it",
    "sicilian_grandma_pan_note_3": "Cheese-before-sauce is signature Grandma pizza technique",
    "sicilian_grandma_pan_tag_1": "sicilian",
    "sicilian_grandma_pan_tag_2": "pan pizza",
    "sicilian_grandma_pan_tag_3": "grandma style",
    "sicilian_grandma_pan_ref_1_title": "Sicilian Pizza and Grandma Pizza History",
    "sicilian_grandma_pan_ref_1_author": "Wikipedia, Goldbelly",
    "sicilian_grandma_pan_faq_1_q": "What's the difference between Sicilian and Grandma pizza?",
    "sicilian_grandma_pan_faq_1_a": "Sicilian pizza (sfincione) is the original thick, spongy pizza from Sicily with traditional toppings like onions, anchovies, and hard cheese. Grandma pizza is an Italian-American adaptation created by Long Island grandmothers - it's thinner than Sicilian, has a crispier bottom from olive oil, and typically features cheese placed directly on the dough before sauce. Both are square and baked in pans, but Grandma is lighter and crispier.",
    "sicilian_grandma_pan_faq_2_q": "Why is it called 'Grandma pizza'?",
    "sicilian_grandma_pan_faq_2_a": "The name honors Italian-American grandmothers on Long Island who created this style in their home kitchens in the early 20th century. Using standard home ovens and sheet pans, they adapted traditional Sicilian sfincione to available American ingredients and equipment. The term 'Grandma pizza' gained wider recognition in pizzerias during the mid-1990s.",
    "sicilian_grandma_pan_faq_3_q": "What does 'sfincione' mean?",
    "sicilian_grandma_pan_faq_3_a": "Sfincione is a Sicilian dialect word meaning 'thick sponge,' perfectly describing the pizza's characteristic thick, spongy, focaccia-like texture. This traditional Sicilian pizza dates back to 17th century Palermo and became popular throughout western Sicily by the mid-19th century. The name directly references its most distinctive quality - the airy, bread-like crumb."
}