{
    "neapolitan_avpn_classic": "Neapolitan Pizza (AVPN Classic)",
    "neapolitan_avpn_classic_subtitle": "UNESCO-protected traditional pizza from Naples, Italy",
    "neapolitan_avpn_classic_family": "Italian Traditional Pizza",
    "neapolitan_avpn_classic_variant": "AVPN Certified Classic",
    "neapolitan_avpn_classic_origin_country": "Italy",
    "neapolitan_avpn_classic_origin_region": "Naples, Campania",
    "neapolitan_avpn_classic_origin_period": "18th-19th century, formalized 1984",
    "neapolitan_avpn_classic_intro": "Neapolitan pizza is the original pizza style from Naples, Italy, recognized by UNESCO as an Intangible Cultural Heritage. Protected by strict AVPN standards since 1984, it represents centuries of culinary tradition and craftsmanship.",
    "neapolitan_avpn_classic_history": "Pizza's origins in Naples trace back centuries to humble flatbreads topped with olive oil, garlic, and herbs. By the 18th century, tomatoes became widely available through Naples' port and were incorporated into these flatbreads among the working class. The modern pizza evolved in the late 18th and early 19th centuries in Naples' poorer areas. A pivotal moment occurred in 1889 when pizzaiolo Raffaele Esposito created Pizza Margherita for Queen Margherita of Savoy, featuring tomatoes, mozzarella, and basil representing the Italian flag colors. Following WWII, American soldiers brought the dish back home, spreading its fame internationally.",
    "neapolitan_avpn_classic_sig_1": "Recognized by UNESCO in 2017 as Intangible Cultural Heritage of Humanity, celebrating the art of the Neapolitan pizzaiuolo",
    "neapolitan_avpn_classic_sig_2": "Protected by AVPN (Associazione Verace Pizza Napoletana) since 1984 with strict international guidelines",
    "neapolitan_avpn_classic_sig_3": "Granted Traditional Speciality Guaranteed (TSG) status by the European Union in 2010",
    "neapolitan_avpn_classic_sig_4": "Embodies Neapolitan values of freshness, flavor, and culinary artistry as a way of life",
    "neapolitan_avpn_classic_sig_5": "Symbol of Italian national pride and identity, representing the red, white, and green of the Italian flag",
    "neapolitan_avpn_classic_consum_1": "Traditionally enjoyed fresh and hot directly from the wood-fired oven in Neapolitan pizzerias",
    "neapolitan_avpn_classic_consum_2": "Consumed as a social and communal event with families and friends gathering to share",
    "neapolitan_avpn_classic_consum_3": "Best eaten with fork and knife in Italy, especially for thicker varieties, though can be eaten by hand informally",
    "neapolitan_avpn_classic_consum_4": "Originally affordable street food for Naples' working class in the 18th-19th centuries",
    "neapolitan_avpn_classic_consum_5": "Now enjoyed worldwide as a premium dining experience, often reserved for special occasions",
    "neapolitan_avpn_classic_evo_1": "Evolved from simple flatbreads with olive oil and garlic in pre-18th century Naples",
    "neapolitan_avpn_classic_evo_2": "Tomatoes incorporated in the 18th century after becoming widely available through Naples' port",
    "neapolitan_avpn_classic_evo_3": "Modern form crystallized in late 18th/early 19th century in Naples' working-class neighborhoods",
    "neapolitan_avpn_classic_evo_4": "Pizza Margherita created in 1889 for Queen Margherita, becoming an iconic symbol",
    "neapolitan_avpn_classic_evo_5": "Spread internationally post-WWII through American soldiers who experienced it in Naples",
    "neapolitan_avpn_classic_evo_6": "AVPN established in 1984 to protect traditional methods and ingredients globally",
    "neapolitan_avpn_classic_rituals_1": "The pizzaiuolo performs four distinct phases of dough preparation with characteristic rotatory movements",
    "neapolitan_avpn_classic_rituals_2": "Dough twirling tradition to oxygenate before baking, often accompanied by singing and storytelling",
    "neapolitan_avpn_classic_rituals_3": "'Pizza sospesa' (suspended pizza) tradition where customers pay for two pizzas, leaving one for a stranger in need",
    "neapolitan_avpn_classic_flavor_1": "Intense yet balanced flavor of freshly baked bread with natural wheat sweetness",
    "neapolitan_avpn_classic_flavor_2": "Tangy, sweet San Marzano tomatoes with low acidity and natural umami",
    "neapolitan_avpn_classic_flavor_3": "Delicate, creamy fresh mozzarella (buffalo milk or fior di latte) with subtle milky notes",
    "neapolitan_avpn_classic_flavor_4": "Aromatic fresh basil adding sweet, peppery, and slightly minty notes",
    "neapolitan_avpn_classic_flavor_5": "Fruity, peppery extra virgin olive oil providing richness and depth",
    "neapolitan_avpn_classic_aroma_1": "Freshly baked bread with yeasty, slightly fermented notes from long fermentation",
    "neapolitan_avpn_classic_aroma_2": "Sweet, aromatic tomato fragrance with hints of acidity",
    "neapolitan_avpn_classic_aroma_3": "Fresh basil releasing sweet, herbaceous, and slightly spicy aromatics",
    "neapolitan_avpn_classic_aroma_4": "Wood smoke from the wood-fired oven adding complexity and depth",
    "neapolitan_avpn_classic_aroma_5": "Caramelized cheese and slight char from high-heat baking",
    "neapolitan_avpn_classic_texture_1": "Soft, thin center (maximum 3mm) that's pliable and slightly wet or 'floppy'",
    "neapolitan_avpn_classic_texture_2": "Puffy, airy cornicione (raised edge 1-2cm high) with leopard-spotted charring",
    "neapolitan_avpn_classic_texture_3": "Light, chewy crumb structure from long fermentation and high hydration",
    "neapolitan_avpn_classic_texture_4": "Crispy exterior from intense heat, yet flexible enough to fold without cracking",
    "neapolitan_avpn_classic_texture_5": "Creamy, melted mozzarella contrasting with tender, elastic dough",
    "neapolitan_avpn_classic_pair_1": "Light Italian white wines like Falanghina or Greco di Tufo to complement acidity",
    "neapolitan_avpn_classic_pair_2": "Italian craft beers, especially pale lagers or wheat beers",
    "neapolitan_avpn_classic_pair_3": "Simple Italian antipasti like bruschetta or caprese salad",
    "neapolitan_avpn_classic_pair_4": "Fresh arugula salad with lemon and olive oil as a side",
    "neapolitan_avpn_classic_pair_5": "Limoncello or espresso for a traditional Italian finish",
    "neapolitan_avpn_classic_fe_1": "Best consumed immediately from the oven when crust is at peak texture and cheese is molten",
    "neapolitan_avpn_classic_fe_2": "Flavors meld within first 2-3 minutes as pizza cools slightly to eating temperature",
    "neapolitan_avpn_classic_fe_3": "Crust softens and becomes chewier as it cools, losing some of its crispy contrast",
    "neapolitan_avpn_classic_tech_1": "Wood-fired oven at extremely high temperatures (430-480°C/800-905°F) for 60-90 seconds",
    "neapolitan_avpn_classic_tech_2": "Long fermentation (minimum 8 hours, often 24-48 hours) at room temperature (22-25°C)",
    "neapolitan_avpn_classic_tech_3": "Hand-kneading or low-speed mixing with hand-stretching, never using a rolling pin",
    "neapolitan_avpn_classic_di_1": "High hydration (55-62.5%) creates soft, extensible dough with airy, open crumb",
    "neapolitan_avpn_classic_di_2": "Type 00 or 0 flour with moderate protein provides delicate texture and easy digestibility",
    "neapolitan_avpn_classic_di_3": "Long fermentation develops complex flavors and improves dough extensibility",
    "neapolitan_avpn_classic_di_4": "No oil or sugar in dough maintains purity and allows natural wheat flavors to shine",
    "neapolitan_avpn_classic_di_5": "Hand-stretching preserves air bubbles and creates characteristic irregular cornicione",
    "neapolitan_avpn_classic_bi_1": "Extreme heat (430-480°C) creates rapid oven spring and characteristic leopard spotting",
    "neapolitan_avpn_classic_bi_2": "Very short bake time (60-90 seconds) preserves moisture and prevents drying",
    "neapolitan_avpn_classic_bi_3": "Wood-fired oven imparts subtle smoky flavor and creates uneven, artisanal charring",
    "neapolitan_avpn_classic_bi_4": "High heat caramelizes cheese and creates contrast between soft center and crispy edges",
    "neapolitan_avpn_classic_bi_5": "Dome-shaped oven creates convection currents that cook pizza evenly from all sides",
    "neapolitan_avpn_classic_flour_strength": "Type 00 or 0 flour, moderate protein (11-12.5%)",
    "neapolitan_avpn_classic_fermentation_bulk": "Minimum 8 hours, typically 24-48 hours at room temperature (22-25°C)",
    "neapolitan_avpn_classic_fermentation_proof": "Individual dough balls proofed 4-6 hours at room temperature",
    "neapolitan_avpn_classic_fermentation_retard": "Not traditional, though some modern pizzaiolos use overnight cold fermentation",
    "neapolitan_avpn_classic_oven_notes": "Wood-fired dome oven essential for authentic flavor and texture, 60-90 second bake time",
    "neapolitan_avpn_classic_use_1": "Traditional Margherita and Marinara pizzas",
    "neapolitan_avpn_classic_use_2": "Simple, high-quality ingredient combinations respecting AVPN guidelines",
    "neapolitan_avpn_classic_rv_1": "Pizza Margherita: tomato, mozzarella, basil, olive oil - the most iconic variant",
    "neapolitan_avpn_classic_rv_2": "Pizza Marinara: tomato, garlic, oregano, olive oil, no cheese - the oldest variant",
    "neapolitan_avpn_classic_rv_3": "Pizza Margherita Extra: adds buffalo mozzarella DOP for premium version",
    "neapolitan_avpn_classic_cs_1": "In hot, humid climates: reduce fermentation time and use cooler water to prevent over-fermentation",
    "neapolitan_avpn_classic_cs_2": "In cold, dry climates: extend fermentation time and use warmer water to maintain yeast activity",
    "neapolitan_avpn_classic_cs_3": "High altitude: adjust hydration slightly lower due to faster evaporation and lower air pressure",
    "neapolitan_avpn_classic_cs_4": "Humid environments: may need slightly less water in dough to maintain proper consistency",
    "neapolitan_avpn_classic_sc_1": "vs. New York Style: Neapolitan has softer, wetter center and puffier crust; NY is crispier and foldable",
    "neapolitan_avpn_classic_sc_2": "vs. Roman Pizza: Neapolitan is thicker and softer; Roman is ultra-thin and cracker-crisp",
    "neapolitan_avpn_classic_sc_3": "vs. Contemporary High-Hydration: AVPN Classic uses lower hydration (55-62.5%) vs. 70%+ modern styles",
    "neapolitan_avpn_classic_ps_1": "Highly sensitive to oven temperature - too low results in dry, tough crust; too high causes burning",
    "neapolitan_avpn_classic_ps_2": "Fermentation time critical - under-fermented dough is tough and flavorless; over-fermented becomes sour",
    "neapolitan_avpn_classic_ps_3": "Flour quality essential - wrong protein content affects texture and extensibility dramatically",
    "neapolitan_avpn_classic_risk_1": "Over-baking even by 30 seconds can dry out the pizza and burn the cornicione",
    "neapolitan_avpn_classic_risk_2": "Insufficient oven temperature results in pale, tough crust without proper char",
    "neapolitan_avpn_classic_risk_3": "Too much sauce or toppings makes center soggy and prevents proper cooking",
    "neapolitan_avpn_classic_note_1": "AVPN certification requires strict adherence to ingredients, techniques, and equipment specifications",
    "neapolitan_avpn_classic_note_2": "The 'pizza sospesa' tradition embodies Neapolitan community spirit and solidarity",
    "neapolitan_avpn_classic_note_3": "Authentic Neapolitan pizza should never exceed 35cm diameter and must be round",
    "neapolitan_avpn_classic_tag_1": "traditional",
    "neapolitan_avpn_classic_tag_2": "unesco heritage",
    "neapolitan_avpn_classic_tag_3": "wood-fired",
    "neapolitan_avpn_classic_ref_1_title": "UNESCO - Art of Neapolitan 'Pizzaiuolo'",
    "neapolitan_avpn_classic_ref_1_author": "UNESCO",
    "neapolitan_avpn_classic_faq_1_q": "What makes Neapolitan pizza authentic according to AVPN?",
    "neapolitan_avpn_classic_faq_1_a": "Authentic Neapolitan pizza must use Type 00 or 0 flour, San Marzano tomatoes, fresh mozzarella (buffalo or fior di latte), fresh basil, and extra virgin olive oil. The dough must be hand-kneaded, fermented for minimum 8 hours, and baked in a wood-fired oven at 430-480°C for 60-90 seconds. The finished pizza must be round, maximum 35cm diameter, with a raised cornicione 1-2cm high.",
    "neapolitan_avpn_classic_faq_2_q": "Why is Neapolitan pizza so soft and floppy in the center?",
    "neapolitan_avpn_classic_faq_2_a": "The soft, slightly wet center is intentional and traditional. The high oven temperature (430-480°C) and very short bake time (60-90 seconds) cook the pizza rapidly, preserving moisture. The high hydration dough (55-62.5%) and minimal toppings also contribute to the characteristic soft, pliable texture that allows the pizza to be folded.",
    "neapolitan_avpn_classic_faq_3_q": "Can I make authentic Neapolitan pizza in a home oven?",
    "neapolitan_avpn_classic_faq_3_a": "While challenging, it's possible to approximate Neapolitan pizza at home. Use a pizza stone or steel preheated to maximum temperature (usually 260-290°C), extend bake time to 5-8 minutes, and consider using a broiler for extra top heat. However, the authentic flavor and texture from a 480°C wood-fired oven cannot be fully replicated in a standard home oven."
}