{
    "steps": {
        "prep": {
            "title": "Mise en Place e Pesagem",
            "desc": "Pese todos os ingredientes com uma balança digital para precisão de 0.1g. {{waterAdvice}}",
            "grandma": "Deixe todos os ingredientes prontos na bancada. Use balança! Xícaras são para café, não farinha.",
            "science": "Precisão é a chave. Uma variação de 5% na água pode mudar drasticamente a reologia (fluxo) da massa.",
            "critical": "Não deixe o fermento entrar em contato direto com o sal por longos períodos antes de misturar."
        },
        "brownie_melt": {
            "title": "Derreter Gordura e Chocolate",
            "desc": "Derreta a manteiga (e chocolate, se usar) suavemente em banho-maria ou microondas. Deixe esfriar um pouco (<45°C).",
            "grandma": "Derreta manteiga e chocolate juntos. Não queime! Deixe esfriar para não cozinhar os ovos.",
            "science": "Derreter a gordura em vez de cremar gera uma textura mais densa e fudgy reduzindo incorporação de ar."
        },
        "brownie_ribbon": {
            "title": "Ponto de Fita (Ovos e Açúcar)",
            "desc": "Bata ovos e açúcar vigorosamente até ficar pálido, grosso e cair em \"fitas\" (aprox 3-5 min).",
            "grandma": "Bata ovos e açúcar até ficar branco e fofo, como um milkshake.",
            "science": "Dissolver o açúcar nos ovos cria uma crosta brilhante e \"papelosa\". Avaliar o ponto de fita garante aeração suficiente.",
            "tip": "Se o açúcar não estiver totalmente dissolvido, a crosta ficará opaca."
        },
        "brownie_fold": {
            "title": "Emulsificação e Dobra",
            "desc": "Despeje a mistura de chocolate/manteiga nos ovos batendo suavemente. Então, DOBRE os secos peneirados apenas até combinar.",
            "grandma": "Despeje o chocolate nos ovos e misture. Adicione farinha e dobre suavemente com espátula. Não misture demais!",
            "critical": "Não bata demais após adicionar farinha! Desenvolver glúten cria um brownie duro e borrachudo em vez de macio."
        },
        "brownie_bake": {
            "title": "Assar",
            "desc": "Asse a {{temp}}°C. Teste com palito: deve sair com migalhas úmidas, não massa líquida.",
            "grandma": "Asse até o palito sair com algumas migalhas grudadas. Se sair limpo, passou do ponto!",
            "science": "Brownies dependem da coagulação da proteína do ovo e cristalização do açúcar para estrutura."
        },
        "cookie_cream": {
            "title": "Cremagem (Manteiga e Açúcar)",
            "desc": "Bata manteiga amolecida e açúcar(es) juntos até ficar leve, fofo e pálido (3-5 min).",
            "grandma": "Misture manteiga e açúcar até parecer glacê fofo.",
            "science": "O método de cremagem incorpora milhões de microbolhas de ar na gordura. Essas bolhas expandem ao assar, criando leveza.",
            "critical": "Manteiga deve estar maleável (18-20°C) mas não derretida. Manteiga derretida não segura bolhas de ar."
        },
        "cookie_emulsify": {
            "title": "Emulsificação (Líquidos)",
            "desc": "Adicione ovos um por um, batendo bem após cada adição. Raspe a tigela.",
            "grandma": "Adicione ovos um por um. Misture bem para não parecer talhado.",
            "science": "Ovos são água; manteiga é gordura. Adição incremental permite que a lecitina emulsione a água na gordura."
        },
        "cookie_dry": {
            "title": "Incorporação (Secos)",
            "desc": "Adicione secos de uma vez. Misture em velocidade BAIXA apenas até a farinha sumir.",
            "grandma": "Adicione farinha e misture devagar. Pare assim que o pó branco sumir.",
            "science": "Minimize o tempo de mistura para limitar glúten. Fios curtos de glúten = cookies macios.",
            "tip": "Adicione recheios (gotas, nozes) agora."
        },
        "cookie_chill": {
            "title": "Maturação a Frio",
            "desc": "Resfrie a massa por pelo menos 2-24 horas antes de assar.",
            "grandma": "Ponha na geladeira por algumas horas (ou noite toda). Faz cookies melhores!",
            "science": "Resfriar hidrata a farinha (menos espalhamento), solidifica a gordura e permite que enzimas quebrem carboidratos (sabor)."
        },
        "cookie_bake": {
            "title": "Assar",
            "desc": "Asse a {{temp}}°C até as bordas firmarem mas o centro estar macio.",
            "grandma": "Asse até as bordas ficarem douradas. O centro deve parecer meio mole ainda.",
            "science": "Caramelização e Maillard ocorrem rápido. O centro terminará de assar na assadeira quente fora do forno."
        },
        "laminated_detrempe": {
            "title": "Detrempe (Massa Base)",
            "desc": "Misture farinha, água, fermento, sal, açúcar e a parte da manteiga da massa até combinar. Não desenvolva muito glúten.",
            "grandma": "Misture os ingredientes da massa até juntar. Não sove muito forte!",
            "science": "Manter a estrutura de glúten subdesenvolvida garante extensibilidade para a laminação."
        },
        "laminated_block": {
            "title": "Formação do Bloco",
            "desc": "Achate a massa em um retângulo, embrulhe bem e resfrie por 12-24h.",
            "grandma": "Achate a massa, embrulhe e ponha na geladeira até o outro dia.",
            "science": "Resfriar relaxa o glúten e garante que a massa tenha a mesma consistência da manteiga."
        },
        "laminated_lockin": {
            "title": "Encapsulamento (Beurrage)",
            "desc": "Bata a manteiga até ficar maleável mas fria (10-12°C). Encapsule na massa.",
            "grandma": "Amasse a manteiga até dobrar mas não quebrar. Embrulhe a massa ao redor.",
            "critical": "Manteiga e massa devem ter a mesma consistência para prevenir quebra (muito fria) ou absorção (muito quente)."
        },
        "laminated_tourage": {
            "title": "Laminação (Tourage)",
            "desc": "Faça 1 Dobra Dupla (Livro) e 1 Dobra Simples (Carta), descansando 30m na geladeira entre dobras.",
            "grandma": "Dobre como livro, descanse. Dobre como carta. Mantenha frio!",
            "science": "Este processo cria camadas alternadas de gordura e massa que estufam ao assar."
        },
        "laminated_shape": {
            "title": "Modelagem",
            "desc": "Abra até 4mm. Corte triângulos (10x25cm). Alongue suavemente e enrole firme. Passe ovo.",
            "grandma": "Abra fino, corte triângulos longos, enrole apertado. Pincele ovo.",
            "tip": "Corte com movimento decisivo para baixo para não selar as camadas nas bordas."
        },
        "laminated_proof": {
            "title": "Fermentação Final",
            "desc": "Fermente a 26-28°C até dobrar e tremer (2-3h).",
            "grandma": "Deixe crescer até tremer como gelatina. Não deixe esquentar muito!",
            "critical": "Evite temperaturas acima de 29°C ou a manteiga derreterá, estragando a estrutura folhada."
        },
        "laminated_bake": {
            "title": "Assar",
            "desc": "Asse a 200°C por 5-7m, depois baixe para 190°C por 12-15m até dourar bem.",
            "grandma": "Forno quente no início para crescer, depois baixe para terminar.",
            "science": "Calor inicial alto cria vapor para \"salto de forno\" e separa camadas antes da crosta firmar."
        },
        "poolish_prep": {
            "title": "Preparar Poolish (Dia -1)",
            "desc": "Misture farinha e água do Poolish (1:1) com a pitada de fermento. Cubra e fermente por 12-16h em temp. ambiente.",
            "grandma": "Misture ingredientes do poolish no pote até parecer massa de panqueca. Cubra e deixe na bancada até amanhã.",
            "science": "Poolish é um pré-fermento 100% hidratação. Aumenta atividade de protease (extensibilidade) e sabor.",
            "tip": "O poolish está pronto quando está borbulhante, dobrou de tamanho e o centro começa a colapsar."
        },
        "biga_prep": {
            "title": "Preparar Biga (Dia -1)",
            "desc": "Misture ingredientes da Biga suavemente. Não sove! Deve ficar uma massa farofenta. Fermente 16-24h a 16-18°C.",
            "grandma": "Misture farinha, água e fermento da biga só para sumir o pó. Deve ficar empelotado e seco. Deixe no fresco até amanhã.",
            "science": "Biga é um pré-fermento rígido (45-50%). Favorece ácido acético, dando força e sabor complexo.",
            "critical": "Misturar demais a Biga desenvolverá muito glúten cedo demais, tornando impossível incorporar na massa final."
        },
        "levain_feed": {
            "title": "Alimentar Levain",
            "desc": "Garanta que seu levain esteja ativo e alimentado 4-6 horas antes. Deve estar no pico.",
            "grandma": "Alimente seu levain para ficar borbulhante e feliz antes de começar.",
            "science": "Usar levain no pico garante população máxima de leveduras e pH ideal."
        },
        "autolyse": {
            "title": "Autólise",
            "desc": "Misture apenas Farinha e Água até não restar farinha seca. Cubra e descanse por 30-60 min. Não adicione sal/fermento ainda.",
            "grandma": "Misture só farinha e água. Deixe descansar 30 min. Farinha bebe a água.",
            "science": "Autólise permite que enzimas protease degradem algumas ligações de glúten, aumentando extensibilidade."
        },
        "mix_final": {
            "title": "Mistura Final ({{method}})",
            "desc": "{{mixAction}}",
            "grandma": "{{mixGrandma}}",
            "science": "Sal é higroscópico e fortalece glúten. Óleo inibe formação de ligações, deve ser adicionado por último.",
            "critical": "Pare de misturar se a massa passar de 26°C para prevenir degradação do glúten."
        },
        "fold_coil": {
            "title": "Dobra em Bobina (Coil Folds)",
            "desc": "Faça dobras Coil a cada 30 min nas primeiras 2h. Molhe as mãos.",
            "grandma": "A cada 30 min, levante a massa e deixe dobrar sob si mesma. Faz a massa ficar forte.",
            "science": "Massas de alta hidratação não podem ser sovadas tradicionalmente. Dobrar alinha o glúten passivamente.",
            "tip": "Se a massa rasgar, descanse mais 10 min. Extensibilidade vem do descanso; elasticidade vem da dobra."
        },
        "knead_windowpane": {
            "title": "Sova e Ponto de Véu",
            "desc": "Sove até a massa passar no Teste do Ponto de Véu: esticar fino sem rasgar.",
            "grandma": "Sove na bancada até ficar lisa como bumbum de bebê. Deve voltar ao cutucar.",
            "science": "Ação mecânica desenrola bobinas de proteína e encoraja ligações cruzadas, criando rede viscoelástica."
        },
        "bulk": {
            "title": "Fermentação em Bloco",
            "desc": "Deixe a massa fermentar em recipiente coberto até {{volume}}.",
            "grandma": "Deixe a massa na tigela coberta até parecer fofa e crescer cerca de metade.",
            "science": "Levedura converte açúcares em CO2 (crescimento) e etanol (sabor). Rede de glúten relaxa.",
            "tip": "Use recipiente com lados retos para julgar o volume com precisão."
        },
        "cold_maturation": {
            "title": "Maturação a Frio",
            "desc": "Coloque na geladeira (4°C) por 24-72 horas.",
            "grandma": "Coloque na geladeira. Pode deixar até 3 dias. Mais tempo, mais saboroso.",
            "science": "Temperaturas frias retardam levedura mas permitem atividade enzimática e bacteriana (sabor e digestibilidade)."
        },
        "staglio": {
            "title": "Estágio (Divisão e Boleamento)",
            "desc": "Divida em {{count}} porções. Boleie firme usando tensão superficial.",
            "grandma": "Corte em pedaços iguais. Enrole em bolas firmes e lisas.",
            "science": "Criar uma \"pele\" de tensão na bola força gases a expandir para cima em vez de para os lados.",
            "critical": "Feche bem a costura de baixo para evitar vazamento de gás."
        },
        "proof": {
            "title": "Fermentação Final (Apprêt)",
            "desc": "Cubra e fermente em temp. ambiente até relaxar (Teste do Dedo).",
            "grandma": "Cubra e deixe descansar até ficarem fofas. Se cutucar, a marca deve voltar devagar.",
            "science": "O glúten relaxa (extensibilidade aumenta). Levedura reinflar a estrutura.",
            "tip": "Se a massa voltar imediatamente, precisa de mais tempo. Se o dente ficar para sempre, passou do ponto."
        },
        "bake": {
            "title": "Assar e Salto de Forno",
            "desc": "{{action}}",
            "grandma": "{{grandmaAction}}",
            "science": "Transferência rápida de calor causa salto de forno. Reação de Maillard acima de 140°C cria cor e sabor.",
            "critical": "Não sobrecarregue com coberturas úmidas, ou bloqueará calor resultando em massa crua."
        }
    },
    "vars": {
        "water": {
            "room": "Use água em temperatura ambiente (20-22°C).",
            "hot": "Use água gelada (4-10°C) para compensar o ambiente quente.",
            "cold": "Use água morna (25-28°C) para acordar o fermento."
        },
        "water_tip": {
            "ideal": "A Temperatura Desejada da Massa (DDT) ideal é 24°C.",
            "hot": "Em ambientes quentes, o atrito da mistura pode superaquecer a massa. Água gelada ajuda a regular isso.",
            "cold": "O fermento é lento no frio. Um início mais quente ajuda a impulsionar a fermentação."
        },
        "mix": {
            "double_hydration": "Dupla Hidratação (Bassinage)",
            "direct": "Mistura Direta",
            "action": {
                "default": "Adicione fermento e misture. Então sal. Por fim, óleo (se usar) quando a massa formar.",
                "biga": "Corte a Biga em pedaços na água. Aperte para quebrar. Adicione farinha gradualmente. Sal por último.",
                "high_hydration": "Adicione fermento e sal. Misture para estrutura. Então, adicione o resto da água em fio (Bassinage)."
            },
            "grandma": {
                "default": "Misture fermento. Depois sal. Se tiver óleo, por último.",
                "biga": "Quebre a Biga na água com as mãos até ficar leitoso. Adicione o resto da farinha e sal.",
                "high_hydration": "Misture fermento e sal. Quando parecer massa, adicione água aos poucos."
            }
        },
        "bake": {
            "action": {
                "default": "Abra suavemente. Cubra pouco. Asse em pedra/aço pré-aquecido.",
                "pan": "Pressione na forma untada. Deixe crescer na forma 30m. Cubra e asse."
            },
            "grandma": {
                "default": "Estique, coloque cobertura e asse bem quente!",
                "pan": "Empurre na forma. Descanse um pouco. Cobertura e forno."
            }
        }
    }
}