{
    "new_york_slice_name": "Nova York (NY Slice)",
    "new_york_slice_desc": "Fatia icônica fina, larga e dobrável. Crocante na borda, macia no centro.",
    "new_york_slice_history": "Evoluiu no início do século 20 a partir da pizza napolitana, adaptada aos fornos a carvão/gás de deck dos EUA e ingredientes locais.",
    "detroit_style_classic_name": "Estilo Detroit",
    "detroit_style_classic_desc": "Pizza retangular de panela com bordas de queijo crocantes (Frico). O molho vai por cima.",
    "detroit_style_classic_history": "Originada em 1946 no Buddy's Rendezvous, assada em bandejas de aço para peças automotivas.",
    "chicago_deep_dish_name": "Chicago Deep Dish",
    "chicago_deep_dish_desc": "Pizza grossa, estilo torta, com bordas altas, recheada com queijo e coberta com molho de tomate pedaçudo.",
    "chicago_deep_dish_history": "Inventada em 1943 na Pizzeria Uno. Uma ponte entre pizza e caçarola.",
    "san_francisco_sourdough_name": "Sourdough de San Francisco",
    "san_francisco_sourdough_desc": "O padrão ouro do pão de fermentação natural. Casca grossa e crocante, miolo aberto e ácido.",
    "san_francisco_sourdough_history": "Popularizado durante a Corrida do Ouro (1849). O lactobacillus local confere um sabor único.",
    "new_haven_apizza_name": "New Haven Apizza",
    "new_haven_apizza_desc": "Assada a carvão, formato oblongo, casca tostada (char). Famosa pela pizza de mariscos brancos (White Clam).",
    "new_haven_apizza_history": "Originada no Frank Pepe's em 1925. Próxima da Napolitana, mas assada por mais tempo e mais quente em fornos a carvão ('Apizza' é a pronúncia local).",
    "nyc_bagel_name": "Bagel de Nova York",
    "nyc_bagel_desc": "Pão denso, mastigável e maltado em formato de anel. Cozido (fervido) antes de assar.",
    "nyc_bagel_history": "Trazido por imigrantes judeus da Europa Oriental. A água de NY é citada, mas a técnica é o segredo.",
    "grandma_pizza_2": "Pizza da Vovó (Grandma)",
    "grandma_pizza_desc": "Pizza quadrada fina de assadeira. Estilo caseiro, fundo frito em azeite.",
    "grandma_pizza_history": "Long Island, anos 1970. Feita por avós em casa usando assadeiras comuns.",
    "chicago_tavern_style_2": "Estilo Chicago Tavern",
    "chicago_tavern_desc": "Massa ultra-fina, crocante como biscoito, cortada em quadrados (party cut). A verdadeira pizza de Chicago.",
    "chicago_tavern_history": "Servida em tavernas de Chicago desde meados do séc. 20 como lanche salgado. Corte quadrado facilita comer com uma mão segurando a cerveja.",
    "montreal_bagel": "Bagel de Montreal",
    "montreal_bagel_desc": "Menor, mais denso, mais doce, assado a lenha e fervido em água com mel.",
    "montreal_bagel_history": "Trazido a Montreal por imigrantes judeus. Compete com NY pela coroa do bagel.",
    "flour_tortilla_sonora": "Tortilha de Farinha (Sonora)",
    "flour_tortilla_sonora_desc": "Tortilha de farinha translúcida e fina como papel, feita com banha e água quente.",
    "flour_tortilla_sonora_history": "Um alimento básico da culinária de Sonora (México).",
    "sicilian_grandma_pan_title": "Pizza Siciliana / Grandma Pan",
    "sicilian_grandma_pan_variant": "Pizza Siciliana / Grandma Pan",
    "sicilian_grandma_pan_intro": "Populares em padarias e pizzarias ítalo-americanas para porções estilo família e venda por fatia.",
    "sicilian_grandma_pan_history": "As pizzas de tabuleiro estilo Siciliana e Grandma interpretam a focaccia italiana e as pizzas de padaria em tortas assadas em assadeiras, com espessura média ou grossa.",
    "sicilian_grandma_pan_tech_1": "Geralmente massa de método direto; algumas fórmulas usam esponja ou poolish.",
    "sicilian_grandma_pan_tech_2": "Hidratação: 65-75%",
    "sicilian_grandma_pan_fermentation_bulk": "2–6 h em temperatura ambiente ou fermentação fria parcial",
    "sicilian_grandma_pan_fermentation_proof": "30–90 min na assadeira antes de assar",
    "sicilian_grandma_pan_use_1": "Pizza de tabuleiro",
    "sicilian_grandma_pan_use_2": "Pizzas estilo família",
    "sicilian_grandma_pan_tag_1": "Pizza de tabuleiro",
    "sicilian_grandma_pan_tag_2": "Pizzas estilo família",
    "st_louis_intro": "Cortada em quadrados ('tavern cut'), popular no Centro-Oeste americano.",
    "st_louis_history": "Conhecida por sua massa fina como bolacha, sem fermento (ou quase sem) e uso de queijo Provel.",
    "st_louis_tech_1": "Nenhum. Frequentemente usa fermento químico ou muito pouco fermento biológico.",
    "st_louis_tech_2": "Hidratação: 40-50%",
    "california_intro": "Associada à 'Culinária Californiana', ingredientes locais frescos e forno a lenha.",
    "california_history": "Popularizada por chefs como Wolfgang Puck, focada em coberturas gourmet não tradicionais e uma massa leve e aerada para porções individuais.",
    "california_tech_1": "Massa direta ou esponja, frequentemente com mel e azeite.",
    "california_tech_2": "Hidratação: 60-68%",
    "california_fermentation_bulk": "12–24 h de fermentação fria",
    "california_fermentation_proof": "1–2 h em temperatura ambiente",
    "brazilian_pizzeria_title": "Pizza de Rodízio / Forno a Gás (BR)",
    "brazilian_pizzeria_intro": "Usada em rodízios e pizzarias focadas em delivery, suportando uma grande variedade de coberturas.",
    "brazilian_pizzeria_history": "A massa de pizzaria brasileira adapta influências italianas e americanas para fornos de lastro (gás ou elétrico), geralmente com hidratação levemente menor e massa enriquecida.",
    "brazilian_pizzeria_tech_1": "Geralmente massa direta; alguns usam biga ou esponja.",
    "brazilian_pizzeria_tech_2": "Hidratação: 55-62%",
    "brazilian_pizzeria_flour": "Farinha forte para pizza (Nacional ou importada), W ~280–330",
    "brazilian_pizzeria_ferm_bulk": "2–8 h em temperatura ambiente ou fermentação parcialmente controlada",
    "brazilian_pizzeria_ferm_proof": "30–90 min antes de assar",
    "brazilian_pizzeria_use_1": "Pizza estilo pizzaria brasileira",
    "brazilian_pizzeria_use_2": "Rodízio e delivery",
    "roman_scrocchiarella_title": "Scrocchiarella Romana (Fina e Crocante)",
    "roman_scrocchiarella_intro": "Comum em pizzarias romanas como alternativa à napolitana, com base crocante e fina, adequada para muitas coberturas.",
    "roman_scrocchiarella_history": "A scrocchiarella romana é um estilo de pizza muito fino e crocante, assado em formas ou diretamente no lastro, distinta da teglia (assadeira).",
    "roman_scrocchiarella_tech_1": "Geralmente massa direta; algumas receitas usam poolish.",
    "roman_scrocchiarella_tech_2": "Hidratação: 55-60%",
    "roman_scrocchiarella_ferm_bulk": "2–6 h em temperatura ambiente ou fermentação fria parcial"
}